p2p-bench/results/run5/scenarios/max_channels_p2p_on-c4/run_1.stdout.txt
WARNING 06-27 06:25:25 [cuda.py:838] Detected different devices in the system: NVIDIA GeForce RTX 5070, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti, NVIDIA GeForce RTX 5060 Ti. Please make sure to set `CUDA_DEVICE_ORDER=PCI_BUS_ID` to avoid unexpected behavior.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x76dee0f2c360>, trust_remote_code=False, seed=1234, num_prompts=64, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, custom_ensure_client_side_data=False, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, timed_trace_chunk_hash_size=16, timed_trace_sec_multiplier=1, timed_trace_label_timestamp='timestamp', timed_trace_label_input_length='input_length', timed_trace_label_output_length='output_length', timed_trace_label_hash_ids='hash_ids', blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=2048, random_range_ratio='0.0', random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, speed_bench_dataset_subset='qualitative', speed_bench_output_len=4096, speed_bench_category=None, label=None, backend='vllm', base_url='http://127.0.0.1:8080', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=4, model='max_channels_p2p_on-c4', input_len=None, output_len=None, tokenizer='/data/models/Qwen/Qwen3.6-27B-FP8', tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=8, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='results/run5/scenarios/max_channels_p2p_on-c4', result_filename='run_1.json', ignore_eos=True, self_timed=None, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='50,90,99', goodput=None, request_id_prefix='bench-eefbff3e-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, chat_template_kwargs=None, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds='25,50', plot_dataset_stats=False)
INFO 06-27 06:25:29 [utils.py:90] Sampling input_len from [4096, 4096] and output_len from [2048, 2048]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Warming up with 8 requests...
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 4
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     64        
Failed requests:                         0         
Maximum request concurrency:             4         
Benchmark duration (s):                  1169.05   
Total input tokens:                      262144    
Total generated tokens:                  131072    
Request throughput (req/s):              0.05      
Output token throughput (tok/s):         112.12    
Peak output token throughput (tok/s):    60.00     
Peak concurrent requests:                6.00      
Total token throughput (tok/s):          336.36    
---------------Time to First Token----------------
Mean TTFT (ms):                          8239.93   
Median TTFT (ms):                        7818.76   
P50 TTFT (ms):                           7818.76   
P90 TTFT (ms):                           8979.88   
P99 TTFT (ms):                           16774.48  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          31.26     
Median TPOT (ms):                        31.45     
P50 TPOT (ms):                           31.45     
P90 TPOT (ms):                           36.21     
P99 TPOT (ms):                           48.54     
---------------Inter-token Latency----------------
Mean ITL (ms):                           100.08    
Median ITL (ms):                         67.85     
P50 ITL (ms):                            67.85     
P90 ITL (ms):                            68.40     
P99 ITL (ms):                            79.25     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          72219.03  
Median E2EL (ms):                        71369.92  
P50 E2EL (ms):                           71369.92  
P90 E2EL (ms):                           85424.76  
P99 E2EL (ms):                           107143.08 
==================================================


  0%|          | 0/8 [00:00<?, ?it/s]
 12%|█▎        | 1/8 [00:54<06:21, 54.45s/it]
 38%|███▊      | 3/8 [01:19<01:56, 23.39s/it]
 50%|█████     | 4/8 [01:28<01:13, 18.41s/it]
 62%|██████▎   | 5/8 [01:49<00:57, 19.18s/it]
 75%|███████▌  | 6/8 [02:02<00:34, 17.40s/it]
 88%|████████▊ | 7/8 [02:13<00:15, 15.27s/it]
100%|██████████| 8/8 [02:15<00:00, 11.24s/it]
100%|██████████| 8/8 [02:15<00:00, 16.97s/it]

  0%|          | 0/64 [00:00<?, ?it/s]
  2%|▏         | 1/64 [00:55<57:52, 55.13s/it]
  3%|▎         | 2/64 [01:05<29:57, 28.99s/it]
  5%|▍         | 3/64 [01:12<18:56, 18.63s/it]
  6%|▋         | 4/64 [01:22<15:23, 15.38s/it]
  8%|▊         | 5/64 [02:03<24:07, 24.54s/it]
  9%|▉         | 6/64 [02:12<18:45, 19.40s/it]
 11%|█         | 7/64 [02:21<15:10, 15.98s/it]
 12%|█▎        | 8/64 [02:33<13:39, 14.63s/it]
 14%|█▍        | 9/64 [03:13<20:45, 22.65s/it]
 16%|█▌        | 10/64 [03:29<18:32, 20.60s/it]
 17%|█▋        | 11/64 [03:39<15:20, 17.37s/it]
 19%|█▉        | 12/64 [03:39<10:30, 12.12s/it]
 20%|██        | 13/64 [04:39<22:27, 26.43s/it]
 22%|██▏       | 14/64 [04:48<17:49, 21.39s/it]
 23%|██▎       | 15/64 [05:06<16:30, 20.21s/it]
 25%|██▌       | 16/64 [05:17<14:03, 17.58s/it]
 27%|██▋       | 17/64 [05:45<16:03, 20.50s/it]
 28%|██▊       | 18/64 [05:55<13:18, 17.36s/it]
 30%|██▉       | 19/64 [06:20<14:47, 19.73s/it]
 31%|███▏      | 20/64 [06:33<12:53, 17.57s/it]
 33%|███▎      | 21/64 [06:54<13:27, 18.78s/it]
 34%|███▍      | 22/64 [07:18<14:08, 20.20s/it]
 36%|███▌      | 23/64 [07:31<12:28, 18.26s/it]
 38%|███▊      | 24/64 [07:51<12:27, 18.70s/it]
 39%|███▉      | 25/64 [08:00<10:09, 15.64s/it]
 41%|████      | 26/64 [08:25<11:47, 18.61s/it]
 42%|████▏     | 27/64 [08:37<10:18, 16.73s/it]
 44%|████▍     | 28/64 [08:58<10:42, 17.85s/it]
 45%|████▌     | 29/64 [09:17<10:32, 18.07s/it]
 47%|████▋     | 30/64 [09:37<10:34, 18.65s/it]
 48%|████▊     | 31/64 [09:46<08:46, 15.96s/it]
 50%|█████     | 32/64 [10:04<08:46, 16.46s/it]
 52%|█████▏    | 33/64 [10:29<09:55, 19.20s/it]
 53%|█████▎    | 34/64 [10:49<09:40, 19.35s/it]
 55%|█████▍    | 35/64 [10:58<07:48, 16.15s/it]
 56%|█████▋    | 36/64 [11:22<08:40, 18.58s/it]
 58%|█████▊    | 37/64 [11:37<07:50, 17.44s/it]
 59%|█████▉    | 38/64 [11:58<07:59, 18.45s/it]
 61%|██████    | 39/64 [12:10<06:56, 16.67s/it]
 62%|██████▎   | 40/64 [12:50<09:29, 23.75s/it]
 64%|██████▍   | 41/64 [12:59<07:22, 19.26s/it]
 66%|██████▌   | 42/64 [13:16<06:45, 18.44s/it]
 67%|██████▋   | 43/64 [13:32<06:12, 17.74s/it]
 69%|██████▉   | 44/64 [13:56<06:33, 19.67s/it]
 70%|███████   | 45/64 [14:18<06:26, 20.35s/it]
 72%|███████▏  | 46/64 [14:33<05:36, 18.67s/it]
 73%|███████▎  | 47/64 [14:50<05:11, 18.35s/it]
 75%|███████▌  | 48/64 [15:03<04:24, 16.56s/it]
 77%|███████▋  | 49/64 [15:24<04:29, 17.96s/it]
 78%|███████▊  | 50/64 [15:45<04:22, 18.78s/it]
 80%|███████▉  | 51/64 [16:05<04:10, 19.28s/it]
 81%|████████▏ | 52/64 [16:20<03:35, 17.95s/it]
 83%|████████▎ | 53/64 [16:39<03:22, 18.41s/it]
 84%|████████▍ | 54/64 [16:52<02:47, 16.76s/it]
 86%|████████▌ | 55/64 [17:18<02:54, 19.36s/it]
 89%|████████▉ | 57/64 [17:55<02:13, 19.12s/it]
 91%|█████████ | 58/64 [18:11<01:48, 18.14s/it]
 92%|█████████▏| 59/64 [18:38<01:42, 20.44s/it]
 94%|█████████▍| 60/64 [18:48<01:10, 17.67s/it]
 95%|█████████▌| 61/64 [19:01<00:49, 16.47s/it]
 97%|█████████▋| 62/64 [19:08<00:27, 13.78s/it]
 98%|█████████▊| 63/64 [19:23<00:14, 14.01s/it]
100%|██████████| 64/64 [19:29<00:00, 11.60s/it]
100%|██████████| 64/64 [19:29<00:00, 18.27s/it]